finding-files.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-03 Sat 22:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Toby Tripp" />
<link rel="stylesheet"  href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/htmlize.css">
<link rel="stylesheet" href="css/config.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<div id="outline-container-org487d3ce" class="outline-2">
<h2 id="org487d3ce">Finding Files</h2>
<div class="outline-text-2" id="text-org487d3ce">
</div>
<div id="outline-container-orgb46b6e6" class="outline-3">
<h3 id="orgb46b6e6">Projectile</h3>
<div class="outline-text-3" id="text-orgb46b6e6">
<p>
One important note about <code>projectile</code> and <code>flx</code>: their matching is
<i>aggressive</i>.  This is a nice feature most of the time, except when
you want to open a new file.  They'll eagerly find you some
file–any file–that matches the name you're trying to enter.  So, to
turn this off temporarily press: <code>C-f</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>require-package 'f<span style="color: #2aa198;">)</span> <span style="color: #586e75;">;; </span><span style="color: #586e75;">undeclared dependency?</span>
<span style="color: #2aa198;">(</span>require-package 'projectile<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>projectile-global-mode<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>global-set-key   <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-x f"</span><span style="color: #b58900;">)</span> 'projectile-find-file<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>global-unset-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"&lt;f4&gt;"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>global-set-key   <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"&lt;f4&gt;"</span><span style="color: #b58900;">)</span> 'projectile-find-file<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">def-projectile-commander-method</span> ?j
  <span style="color: #2aa198;">"Jack-in."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>opts <span style="color: #cb4b16;">(</span>projectile-current-project-files<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
         <span style="color: #dc322f;">(</span>file <span style="color: #cb4b16;">(</span>ido-completing-read
                <span style="color: #2aa198;">"Find file: "</span>
                opts
                nil nil nil nil
                <span style="color: #268bd2;">(</span>car <span style="color: #859900;">(</span>cl-member-if
                      <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #b58900;">(</span>f<span style="color: #b58900;">)</span>
                        <span style="color: #b58900;">(</span>string-match <span style="color: #2aa198;">"core\\.clj\\'"</span> f<span style="color: #b58900;">)</span><span style="color: #dc322f;">)</span>
                      opts<span style="color: #859900;">)</span><span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>find-file <span style="color: #dc322f;">(</span>expand-file-name
                file <span style="color: #cb4b16;">(</span>projectile-project-root<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>run-hooks 'projectile-find-file-hook<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>cider-jack-in<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
The default mode-line “lighter” for Projectile Mode is:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #2aa198;">(</span><span style="color: #268bd2; font-style: italic;">:eval</span>
  <span style="color: #b58900;">(</span>format <span style="color: #2aa198;">" Projectile[%s]"</span> <span style="color: #268bd2;">(</span>projectile-project-name<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
That's a bit much for me; I like things minimal. So, I reset it to be blank:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> projectile-mode-line nil<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a1db7c" class="outline-3">
<h3 id="org6a1db7c">Fuzzy Matching of File and Command Names</h3>
<div class="outline-text-3" id="text-org6a1db7c">
<p>
Fuzzy matching is brought in with the <code>flx</code> package.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>require-package 'flx-ido<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">flx-ido</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>ido-mode 1<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>ido-everywhere 1<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>flx-ido-mode 1<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> ido-enable-flex-matching t<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> ido-use-faces t<span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/nonsequitur/smex">SMEX</a> shows recently used
commands on the <code>M-x</code> prompt:
</p>

<blockquote>
<p>
Smex is a M-x enhancement for Emacs. Built on top of Ido, it
provides a convenient interface to your recently and most
frequently used commands. And to all the other commands, too.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>require-package 'smex<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>smex-initialize<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> smex-save-file <span style="color: #b58900;">(</span>concat user-emacs-directory <span style="color: #2aa198;">".smex-items"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"M-x"</span><span style="color: #b58900;">)</span> 'smex<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c x"</span><span style="color: #b58900;">)</span> 'smex-major-mode-commands<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga24e77c" class="outline-3">
<h3 id="orga24e77c">Open Recent Files</h3>
<div class="outline-text-3" id="text-orga24e77c">
<p>
Enable “Open Recent” and give it a keybinding:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>recentf-mode 1<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c f"</span><span style="color: #b58900;">)</span> 'recentf-open-files<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2018-03-03 Sat 22:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
